# 학생성적 프로그램, 로또 등 간단한 코드는 외워두어야 나중에 더 길고 복잡한 코드르 응용할 수 있어.
# 나중에는 수치적인 형태를 함수로 풀어내는 것을 (기울기 확률 ... 등) 다룰거야.

# 디셔너리 및 함수를 사용해서 코드를 줄일거야.
# - 함수를 사용하면 오류 찾는 것이 용이
# - 함수는 공유할 수 있어



# 리스트에 1부터 25까지 숫자를 리스트에 입력하고 출력하시오.

l = []

for i in range(1, 26) :
    print(i)
    l.append(i)
print(l)

''' 선생님 답
a = []
for i in range(0, 25) :
    a.append(i+1)
print(a)
'''
print('-'*100)

# 1부터25까지 2차원 리스트 생성 ********** 다시 풀어보기 ********** 풀이는 여러가지가 있어
# [[1,2,3,4,5], [6,7,8,9,10], ..., [21,22,23,24,25]]

''' 내가 푼 거
l2 = []
for i in range(0,25) :
    l2.append(i+1)
    ln = []
    for j in range(len(l2)) :
        for ln in l2 :
'''            
        
        
        
                


    
