# 1부터25까지 2차원 리스트 생성 ********** 다시 풀어보기 ********** 풀이는 여러가지가 있어
# [[1,2,3,4,5], [6,7,8,9,10], ..., [21,22,23,24,25]]

# 또 다른 풀이

a = [[],[],[],[],[]]
for i in range(0, 5) : # 0, 1, 2, 3, 4
    for j in range(0, 5) : # 0, 1, 2, 3, 4
        # a[0][0] = 1
        # a[0][1] = 2
        # a[0][2] = 3
        # a[0][3] = 4
        # a[0][4] = 5
        # a[1][0] = 6
        # a[i][j] = (5*i)+j+1
        a[i].append((5*i)+j+1)
print(a)


# 다른 풀이
# 리스트 공간 초기화를 먼저 해줘야 함.
# a = [[],[],[],[],[]]가 아니라
# 또는 a = [[0]*5] * 5          => 얕은 복사
a = [[0]*5 for _ in range(5)] # => 깊은 복사, 컴프리헨션
value = 1
for i in range(0, 5) : # 0, 1, 2, 3, 4
    for j in range(0, 5) : # 0, 1, 2, 3, 4
        a[i][j] = value # (5*i)+j+1
        value += 1
        
print(a)

a = [[0,0,0,0,0],[0,0,0,0,0],[0,0,0,0,0],[0,0,0,0,0],[0,0,0,0,0]]